; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=42, out_folder=htg/blocksworld/training, instance_id=22, seed=2046, goal_proportion=0.1

(define (problem blocksworld-22)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b7)
    (on b7 b34)
    (on b34 b41)
    (on b41 b5)
    (on b5 b14)
    (on b14 b38)
    (on b38 b42)
    (on b42 b19)
    (on b19 b28)
    (on b28 b9)
    (on b9 b15)
    (on b15 b2)
    (on b2 b40)
    (on b40 b4)
    (on b4 b3)
    (on b3 b35)
    (on b35 b25)
    (on b25 b23)
    (on b23 b21)
    (on b21 b31)
    (on b31 b33)
    (on b33 b17)
    (on b17 b37)
    (on b37 b29)
    (on b29 b6)
    (on b6 b39)
    (on b39 b10)
    (on b10 b1)
    (on b1 b24)
    (on b24 b11)
    (on b11 b30)
    (on b30 b18)
    (on b18 b12)
    (on b12 b32)
    (on b32 b8)
    (on b8 b13)
    (on b13 b20)
    (on b20 b27)
    (on b27 b22)
    (on b22 b26)
    (on b26 b36)
    (on-table b36))
 (:goal  (and 
    (clear b4)
    (on b4 b3)
    (on b3 b2)
    (on-table b2)
    (clear b1)
    (on-table b1))))

; plan
1. (unstack b16 b7)
   deleted: (on b16 b7) (clear b16) (arm-empty)
   added: (holding b16) (clear b7)
   goals met: 1 of 6
2. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 6
3. (unstack b7 b34)
   deleted: (on b7 b34) (clear b7) (arm-empty)
   added: (holding b7) (clear b34)
   goals met: 1 of 6
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 6
5. (unstack b34 b41)
   deleted: (on b34 b41) (clear b34) (arm-empty)
   added: (holding b34) (clear b41)
   goals met: 1 of 6
6. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 1 of 6
7. (unstack b41 b5)
   deleted: (on b41 b5) (clear b41) (arm-empty)
   added: (holding b41) (clear b5)
   goals met: 1 of 6
8. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 1 of 6
9. (unstack b5 b14)
   deleted: (on b5 b14) (clear b5) (arm-empty)
   added: (holding b5) (clear b14)
   goals met: 1 of 6
10. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 6
11. (unstack b14 b38)
   deleted: (on b14 b38) (clear b14) (arm-empty)
   added: (holding b14) (clear b38)
   goals met: 1 of 6
12. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 6
13. (unstack b38 b42)
   deleted: (on b38 b42) (clear b38) (arm-empty)
   added: (holding b38) (clear b42)
   goals met: 1 of 6
14. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 1 of 6
15. (unstack b42 b19)
   deleted: (on b42 b19) (clear b42) (arm-empty)
   added: (holding b42) (clear b19)
   goals met: 1 of 6
16. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 1 of 6
17. (unstack b19 b28)
   deleted: (on b19 b28) (clear b19) (arm-empty)
   added: (holding b19) (clear b28)
   goals met: 1 of 6
18. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 6
19. (unstack b28 b9)
   deleted: (on b28 b9) (clear b28) (arm-empty)
   added: (holding b28) (clear b9)
   goals met: 1 of 6
20. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 1 of 6
21. (unstack b9 b15)
   deleted: (on b9 b15) (clear b9) (arm-empty)
   added: (holding b9) (clear b15)
   goals met: 1 of 6
22. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 6
23. (unstack b15 b2)
   deleted: (on b15 b2) (clear b15) (arm-empty)
   added: (holding b15) (clear b2)
   goals met: 1 of 6
24. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 6
25. (unstack b2 b40)
   deleted: (on b2 b40) (clear b2) (arm-empty)
   added: (holding b2) (clear b40)
   goals met: 1 of 6
26. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 6
27. (unstack b40 b4)
   deleted: (on b40 b4) (clear b40) (arm-empty)
   added: (holding b40) (clear b4)
   goals met: 3 of 6
28. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 6
29. (unstack b4 b3)
   deleted: (on b4 b3) (clear b4) (arm-empty)
   added: (holding b4) (clear b3)
   goals met: 1 of 6
30. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 6
31. (unstack b3 b35)
   deleted: (on b3 b35) (clear b3) (arm-empty)
   added: (holding b3) (clear b35)
   goals met: 2 of 6
32. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 3 of 6
33. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 2 of 6
34. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 4 of 6
35. (unstack b35 b25)
   deleted: (on b35 b25) (clear b35) (arm-empty)
   added: (holding b35) (clear b25)
   goals met: 4 of 6
36. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 4 of 6
37. (unstack b25 b23)
   deleted: (on b25 b23) (clear b25) (arm-empty)
   added: (holding b25) (clear b23)
   goals met: 4 of 6
38. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 6
39. (unstack b23 b21)
   deleted: (on b23 b21) (clear b23) (arm-empty)
   added: (holding b23) (clear b21)
   goals met: 4 of 6
40. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 4 of 6
41. (unstack b21 b31)
   deleted: (on b21 b31) (clear b21) (arm-empty)
   added: (holding b21) (clear b31)
   goals met: 4 of 6
42. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 4 of 6
43. (unstack b31 b33)
   deleted: (on b31 b33) (clear b31) (arm-empty)
   added: (holding b31) (clear b33)
   goals met: 4 of 6
44. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 4 of 6
45. (unstack b33 b17)
   deleted: (on b33 b17) (clear b33) (arm-empty)
   added: (holding b33) (clear b17)
   goals met: 4 of 6
46. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 4 of 6
47. (unstack b17 b37)
   deleted: (on b17 b37) (clear b17) (arm-empty)
   added: (holding b17) (clear b37)
   goals met: 4 of 6
48. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 4 of 6
49. (unstack b37 b29)
   deleted: (on b37 b29) (clear b37) (arm-empty)
   added: (holding b37) (clear b29)
   goals met: 4 of 6
50. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 4 of 6
51. (unstack b29 b6)
   deleted: (on b29 b6) (clear b29) (arm-empty)
   added: (holding b29) (clear b6)
   goals met: 4 of 6
52. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 4 of 6
53. (unstack b6 b39)
   deleted: (on b6 b39) (clear b6) (arm-empty)
   added: (holding b6) (clear b39)
   goals met: 4 of 6
54. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 4 of 6
55. (unstack b39 b10)
   deleted: (on b39 b10) (clear b39) (arm-empty)
   added: (holding b39) (clear b10)
   goals met: 4 of 6
56. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 4 of 6
57. (unstack b10 b1)
   deleted: (on b10 b1) (clear b10) (arm-empty)
   added: (holding b10) (clear b1)
   goals met: 5 of 6
58. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 5 of 6
59. (unstack b1 b24)
   deleted: (on b1 b24) (clear b1) (arm-empty)
   added: (holding b1) (clear b24)
   goals met: 4 of 6
60. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 6 of 6
